/**
 * @author biggerstar
 * 太乙框架本着万物皆模块的思想进行构建，所有功能都是相对应插件提供支持，各插件高内聚和高度解耦,互相独立不影响
 * 框架默认支持太乙阳内核，另有太乙阴内核包可选安装，框架本身的拓展性非常强，不仅能支持安装各种插件，也支持切换内核
 *  比如后面也能支持以框架插件形式编写 乾坤微前端框架等等 这类不使用iframe的内核并安装到太乙提供相应功能
 * */

export * from 'tiyi-core'
export * from 'tiyi-core-yang'
export * from './core'

//-------------------------------------
import {__tiyi__, __TIYI__, TIYI} from "tiyi-core"

// TODO 为所有包编写md文档

//-------------------------------------------------------
window[__tiyi__] = window[__TIYI__] = TIYI
//-------------------------------------------------------





